---
kind: type
id: T:Autodesk.Revit.DB.Visual.TileBrickType
source: html/2046569b-2780-e20b-a6c7-e26e1cf0f901.htm
---
# Autodesk.Revit.DB.Visual.TileBrickType

The enumerated type representing the permitted values for the asset property "TileBrickType" from the "Tile" schema.

## Syntax (C#)
```csharp
public enum TileBrickType
```